#+BEGIN: clocktable :maxlevel 2 :scope file
Clock summary at [2013-04-05 Fri 13:39]

| Headline                          |   Time |
|-----------------------------------+--------|
| *Total time*                      | *9:21* |
|-----------------------------------+--------|
| DONE Show feeds/basic layout      |   1:17 |
| DONE Add feeds to DB              |   0:42 |
| DONE Import OPML                  |   1:51 |
| DONE Fetch feeds                  |   1:27 |
| DONE Display feed entries         |   2:49 |
| DONE Better logging               |   0:16 |
| DONE Sort feed entries by date    |   0:10 |
| DONE Read/Unread                  |   0:45 |
| DONE Better CSS for feed contents |   0:04 |
#+END:

* DONE Show feeds/basic layout
  :LOGBOOK:
  CLOCK: [2013-03-16 Sat 01:22]--[2013-03-16 Sat 01:58] =>  0:36
  CLOCK: [2013-03-15 Fri 00:31]--[2013-03-15 Fri 00:52] =>  0:21
  CLOCK: [2013-03-15 Fri 00:10]--[2013-03-15 Fri 00:30] =>  0:20
  :END:
* DONE Add feeds to DB
  :LOGBOOK:
  CLOCK: [2013-03-16 Sat 02:21]--[2013-03-16 Sat 02:41] =>  0:20
  CLOCK: [2013-03-16 Sat 01:58]--[2013-03-16 Sat 02:20] =>  0:22
  :END:
* DONE Import OPML
  :LOGBOOK:
  CLOCK: [2013-03-19 Tue 00:40]--[2013-03-19 Tue 02:09] =>  1:29
  CLOCK: [2013-03-16 Sat 20:50]--[2013-03-16 Sat 21:12] =>  0:22
  :END:
* DONE Fetch feeds
  :LOGBOOK:
  CLOCK: [2013-03-20 Wed 00:47]--[2013-03-20 Wed 02:14] =>  1:27
  :END:
* DONE Display feed entries
  :LOGBOOK:
  CLOCK: [2013-03-21 Thu 00:00]--[2013-03-21 Thu 02:49] =>  2:49
  :END:

* DONE Better logging
  :LOGBOOK:
  CLOCK: [2013-03-24 Sun 19:59]--[2013-03-24 Sun 20:15] =>  0:16
  :END:
* DONE Sort feed entries by date
  :LOGBOOK:
  CLOCK: [2013-03-29 Fri 16:17]--[2013-03-29 Fri 16:27] =>  0:10
  :END:
* DONE Read/Unread
  :LOGBOOK:
  CLOCK: [2013-04-02 Tue 00:31]--[2013-04-02 Tue 00:33] =>  0:02
  CLOCK: [2013-04-01 Mon 23:48]--[2013-04-02 Tue 00:21] =>  0:33
  CLOCK: [2013-03-29 Fri 16:12]--[2013-03-29 Fri 16:17] =>  0:05
  CLOCK: [2013-03-28 Thu 14:35]--[2013-03-28 Thu 14:40] =>  0:05
  :END:
* DONE Better CSS for feed contents
  :LOGBOOK:
  CLOCK: [2013-04-02 Tue 00:27]--[2013-04-02 Tue 00:31] =>  0:04
  :END:
